# Напишите программу, которая вычисляет сумму модулей.

a = float(input())
b = float(input())
c = float(input())
d = float(input())
e = float(input())

summ = abs(a) + abs(b) + abs(c) + abs(d) + abs(e)

print(summ)
