# Напишите программу, которая принимает целое число xxx и определяет, принадлежит ли данное число указанному промежутку.

x = int(input())
if -1 < x < 17:
    print("Принадлежит")
else:
    print("Не принадлежит")