#  Copyright (c) Vladimir Modenov.
#  Created: 13.08.2022, 22:21
#  Project: StepikPythonProjects
#  File: Factorial.py

# На вход программе подается натуральное число n. Напишите программу, которая вычисляет n!.

from math import factorial

n = int(input())

print(factorial(n))
