#  Copyright (c) Vladimir Modenov.
#  Created: 31.08.2022, 23:40
#  Project: StepikPythonProjects
#  File: sWAPcASE.py

# На вход программе подается строка. Напишите программу, которая меняет регистр символов,
# другими словами замените все строчные символы заглавными и наоборот.

s = input()

print(s.swapcase())
